# یک جادوگر تصمیم گرفته است که با استفاده از یک طلسم خاص، قدرت اعداد را افزایش دهد! ااو یک عدد
#  n
#  به عنوان تعداد مراحل و یک عدد
#  x
#  انتخاب می‌کند که عملیات روی آن انجام می‌گیرد. سپس کارهای زیر را انجام می‌دهد:
# اگر عدد فرد باشد، مقدار آن را دو برابر کرده و 1 واحد کم می‌کند.
# اگر عدد زوج باشد، مقدار آن را نصف می‌کند.
# جادوگر این عملیات را دقیقاً 
# n
#  بار انجام می‌دهد.
# 📝 ورودی:
#     عدد صحیح n که تعداد مراحل را مشخص می‌کند (1 ≤ n ≤ 20).
#     عدد صحیح x که مقدار اولیه است (1 ≤ x ≤ 1000).
# 📤 خروجی:
# در انتها مقدار نهایی x را نمایش بده.
# ورودی 1:
# 5
# 10
# خروجی 1:
# 65

n = int (input("Enter The Number Of Steps: "))
x = int (input("Enter The Number You Want: "))

for i in range(n) :
    if x %2 == 0:
        x = x // 2
    else:
        x = (x * 2) -1

print(x)
