# در این تمرین، شما باید یک تابع به نام 
# is_even 
# تعریف کنید که بررسی کند آیا عدد داده شده زوج است یا فرد. این یک مفهوم اساسی 
# در ریاضیات و برنامه‌نویسی است که در بسیاری از مسائل استفاده می‌شود.
# وظیفه شما:
# یک تابع به نام 
# is_even(n) 
# تعریف کنید که:
#یک عدد صحیح n به عنوان ورودی دریافت کند.
#بررسی کند که آیا عدد زوج است یا نه.
#مقدار True را برگرداند اگر عدد زوج باشد.
#مقدار False را برگرداند اگر عدد فرد باشد.
#مقدار باید برگردانده 
# (return) 
# شود و نه مستقیماً چاپ شود.


def is_even(number):
    if number % 2 == 0 :
        return True 
    else:
        return False

number = int(input("Enter number :"))

print(is_even(number))
