# یک جادوگر دو مجموعه جادویی به نام‌های SetA و SetB دارد. هر کدام از این مجموعه‌ها شامل چند عدد مختلف هستند. جادوگر باید دو کار انجام دهد:

# SetA = {1, 2, 3, 4}
# SetB = {3, 4, 5, 6}

#     جادوگر باید تمامی اعضای موجود در هر دو مجموعه (اجتماع) را مشخص کند.
#     باید مجموعه‌ی مشترک (اشتراک) بین SetA و SetB را پیدا کند.

# وظیفه شما، برنامه‌ای بنویسید که:

#     اجتماع اعضای موجود در هر دو مجموعه (اجتماع) را پیدا کنید و با u نشان دهید.
#     مجموعه مشترک (اشتراک) بین SetA و SetB را پیدا کنید و با i نشان دهید.
#     خروجی مورد ۱ و ۲ را به ترتیب در ۲ سطر و به شکل زیر نمایش دهد.

# {اجتماع}
# {اشتراک}

# تعریف ست ها 
SetA = {1,2,3,4}
SetB = {3,4,5,6}

# یو مساوی است با هر انچه که در 
# SetA یا SetB 
# موجود است 
U = SetA | SetB

#آی مساویس با هر انچه که در 
#SetA و SetB
#موجود است 
I = SetA & SetB

print(U)
print(I)