# یک ماشین به نام «ماشین جادویی» داریم که یک عدد اولیه 
# n 
# را می‌گیرد و می‌خواهد به 1 برسد. ماشین می‌تواند دو کار انجام دهد:
#اگر عدد فعلی بر ۲ بخش‌پذیر باشد، آن را نصف می‌کند.
#اگر عدد فعلی بر ۲ بخش‌پذیر نباشد، عدد را ضربدر ۳ کرده و ۱ را به آن اضافه می‌کند.
# وظیفه شما این است که برنامه‌ای بنویسید که عدد اولیه n را از ورودی دریافت کرده و نشان دهید که چگونه ماشین به 1 می‌رسد.
# ورودی:
# یک عدد صحیح n (۲ ≤ n ≤ ۱۰۰۰)
# خروجی:
# در هر مرحله، مقدار فعلی عدد n را چاپ کنید تا وقتی که عدد به ۱ برسد. 



n = int (input("Enter The Number You Want:"))
while n != 1 :
    if n % 2 ==0:
        n = n//2 
        print(n)
    else:
        n = (n * 3) + 1
        print(n)

    
