# در سرزمین جادوگران، یک طلسم قدیمی وجود دارد که می‌گوید هر عدد جادویی باید ویژگی خاصی داشته باشد:
# اگر عددی بر ۳ بخش‌پذیر باشد، عدد جادویی محسوب می‌شود.
# اگر عددی بر ۵ بخش‌پذیر باشد، عدد نفرین‌شده محسوب می‌شود.
# اگر عددی هم جادویی باشد و هم نفرین‌شده، عدد افسانه‌ای محسوب می‌شود.
# در غیر این صورت، عدد معمولی است.
# وظیفه شما: برنامه‌ای بنویسید که یک عدد صحیح از ورودی بگیرد و تعیین کند که آن عدد جادویی، نفرین‌شده، افسانه‌ای یا معمولی است.
# دقت کنید که کلمات داخل گیومه دقیقا به عنوان خروجی نمایش داده شود.
# ورودی:
# یک عدد صحیح n
# خروجی:
# اگر n بر ۳ بخش‌پذیر باشد، چاپ کند: "جادویی"
# اگر n بر ۵ بخش‌پذیر باشد، چاپ کند: "نفرین شده"
# اگر n بر هر دو بخش‌پذیر باشد، چاپ کند: "افسانه ای"
# در غیر این صورت، چاپ کند: "معمولی"

n = int (input("Enter The Number You Want:"))

for i in range(1):
    if n % 3 == 0 and n % 5 == 0 :
        print(f"{n} Legendary")

    elif n % 5 == 0:
        print (f"{n} Cursed")

    elif n % 3 == 0 :
        print(f"{n} Magical")
    else:
        print(f"{n} Usual")    

#version without for 
"""
n = int (input("Enter The Number You Want:"))

if n % 3 == 0 and n % 5 == 0 :
    print(f"{n} Legendary")

elif n % 5 == 0:
    print (f"{n} Cursed")

elif n % 3 == 0 :
    print(f"{n} Magical")
else:
    print(f"{n} Usual")    

"""